Repository: Tencent-RTC/TUIKit_iOS
Catalog: call/TUICallKit_Swift/Resources/TUICallKitLocalized.xcstrings
Source language: en
Languages: ar, ja, zh_hans, zh_hant

# TUICallKit.inviteToVideoCall
source: invites you to a video call
ar: يدعوك لمكالمة فيديو
ja: ビデオ通話に招待されました
zh_hans: 邀请你视频通话
zh_hant: 邀請你視頻通話

# TUICallKit.inviteToAudioCall
source: invites you to a voice call
ar: يدعوك لمكالمة صوتية
ja: 音声通話に招待されました
zh_hans: 邀请你语音通话
zh_hant: 邀請你語音通話

# TUICallKit.Group.inviteToGroupCall
source: invites you to a group call
ar: يدعوك إلى مكالمة
ja: グループ通話に招待します
zh_hans: 邀请你加入多人通话
zh_hant: 邀請你加入多人通話

# TUICallKit.determine
source: Confirm
ar: تأكيد
ja: 確認
zh_hans: 确定
zh_hant: 確定

# TUICallKit.lineBusy
source: The other party is busy. Please try again later
ar: الطرف الآخر في مكالمة، يرجى المحاولة مرة أخرى لاحقًا
ja: 相手は通話中です。しばらくしてからもう一度お試しください
zh_hans: 对方正在忙，请稍后再试
zh_hant: 對方正在通話中，請稍後再試

# TUICallKit.otherPartyHangup
source: The other party hung up, call ended
ar: أنهى الطرف الآخر المكالمة
ja: 相手が切断、通話終了
zh_hans: 对方已挂断，通话结束
zh_hant: 對方已掛斷，通話結束

# TUICallKit.otherPartyReject
source: The other party declined your call request
ar: الطرف الآخر رفض طلب المكالمة الخاص بك
ja: 相手があなたの通話リクエストを拒否しました
zh_hans: 对方拒绝了您的通话请求
zh_hant: 對方拒絕了您的通話請求

# TUICallKit.otherPartyNoResponse
source: The other party did not answer. Please try again later
ar: لم يجب الطرف الآخر، يرجى المحاولة مرة أخرى لاحقًا
ja: 相手が応答しませんでした。しばらくしてからもう一度お試しください
zh_hans: 对方未接听，请稍后再试
zh_hant: 對方未接聽，請稍後再試

# TUICallKit.otherPartyCanceled
source: The other party cancelled the call
ar: ألغى الطرف الآخر المكالمة
ja: 相手が通話をキャンセルしました
zh_hans: 对方已取消通话
zh_hant: 對方已取消通話

# TUICallKit.calNotCallYourself
source: You cannot call yourself
ar: غير قادر على الاتصال بنفسك
ja: 自分自身に通話を開始できません
zh_hans: 不能呼叫自己
zh_hant: 不能呼叫自己

# TUICallKit.youHaveMissedCalls
source: You are currently in a call. Please end it before making a new one
ar: أنت في مكالمة ولا يمكنك بدء مكالمة أخرى
ja: 通話中のため、別の通話を開始できません
zh_hans: 您当前正在通话中，请结束通话后再拨打
zh_hant: 您當前正在通話中，請結束通話後再撥打

# TUICallKit.Recents.noCall
source: No Calls
ar: لا توجد مكالمات
ja: 通話履歴がありません
zh_hans: 暂无通话记录
zh_hant: 暫無通話記錄

# TUICallKit.Recents.noMissedCall
source: No Missed Calls
ar: لا توجد مكالمات فائتة
ja: 不在着信がありません
zh_hans: 暂无未接来电
zh_hant: 暫無未接來電

# TUICallKit.ErrorInvalidUserId
source: User does not exist. Please verify if the user is registered or if invalid characters were entered
ar: المستخدم غير موجود. يرجى التحقق مما إذا كان المستخدم مسجلاً أو إذا تم إدخال أحرف غير صالحة
ja: ユーザーが存在しません。登録済みか、または不正な文字が入力されていないかご確認ください
zh_hans: 用户不存在，请确认该用户是否已注册或是否输入非法字符
zh_hant: 用戶不存在，請確認該用戶是否已註冊或是否輸入非法字符

# TUICallKit.ErrorGroupHasActiveCall
source: This group already has an active call
ar: هذه المجموعة لديها بالفعل مكالمة نشطة
ja: このグループではすでに通話が進行中です
zh_hans: 该群组已有通话正在进行中
zh_hant: 該群組已有通話正在進行中

# TUICallKit.User.Exceed.Limit
source: This call supports a maximum of 9 participants
ar: تدعم المكالمة الحالية ما يصل إلى 9 أشخاص متصلين في وقت واحد
ja: 現在の通話は最大9人まで同時にオンラインをサポートします
zh_hans: 当前通话最多支持 9 人同时在线
zh_hant: 當前通話最多支持 9 人同時在線

# TUICallKit.UnableToRestartTheCall
source: You are currently in a call. Please end it before making a new one
ar: أنت حاليًا في مكالمة ، يرجى إنهاء المكالمة قبل الاتصال مرة أخرى
ja: 現在通話中です。通話を終了してから再度発信してください
zh_hans: 您当前正在通话中，请结束通话后再拨打
zh_hant: 您當前正在通話中，請結束通話後再撥打

# TUICallKit.purchased
source: This feature requires audio-video call capability package support. To avoid affecting your usage, it is recommended to go to Tencent Cloud · Real-Time Communication Console to activate free trial or purchase official package
ar: تتطلب هذه الميزة دعم حزمة قدرات المكالمات الصوتية والمرئية. لتجنب التأثير على استخدامك ، يوصى بالانتقال إلى Tencent Cloud · وحدة تحكم الاتصالات في الوقت الفعلي لتفعيل التجربة المجانية أو شراء الحزمة الرسمية
ja: この機能には音声・ビデオ通話機能パッケージのサポートが必要です。ご利用に影響を与えないよう、Tencent Cloud・リアルタイムコミュニケーションコンソールにアクセスして、無料体験を有効にするか、正式パッケージを購入することをお勧めします
zh_hans: 此功能需要音视频通话能力套餐支持，为不影响您的使用，建议您前往腾讯云·实时音视频控制台，开通免费体验或选购正式套餐
zh_hant: 此功能需要音視頻通話能力套餐支持，為不影響您的使用，建議您前往騰訊雲·實時音視頻控制台，開通免費體驗或選購正式套餐

# TUICallKit.support
source: Your current package type does not support this feature. To unlock more capabilities, it is recommended to go to Tencent Cloud · Real-Time Communication Console to upgrade your package
ar: نوع الحزمة الحالي الخاص بك لا يدعم هذه الميزة. لفتح المزيد من القدرات ، يوصى بالانتقال إلى Tencent Cloud · وحدة تحكم الاتصالات في الوقت الفعلي لترقية حزمتك
ja: 現在のパッケージタイプはこの機能をサポートしていません。より多くの機能をアンロックするには、Tencent Cloud・リアルタイムコミュニケーションコンソールにアクセスしてパッケージをアップグレードすることをお勧めします
zh_hans: 您当前的套餐类型暂不支持此功能，为解锁更多能力，建议您前往腾讯云·实时音视频控制台升级套餐
zh_hant: 您當前的套餐類型暫不支持此功能，為解鎖更多能力，建議您前往騰訊雲·實時音視頻控制台升級套餐

# TUICallKit.ErrorInPeerBlacklist
source: The identifier is in blacklist. Failed to send this message!
ar: المعرف في القائمة السوداء. فشل في إرسال هذه الرسالة!
ja: 通話の開始に失敗しました。ユーザーがブラックリストに登録されているため、発信が禁止されています！
zh_hans: 发起通话失败，用户在黑名单中，禁止发起！
zh_hant: 發起通話失敗，用戶在黑名單中，禁止發起！

# TUICallKit.ErrorInvalidLogin
source: Failed to initiate the call. Please check your login status and try again
ar: فشل بدء المكالمة، يرجى التحقق من حالة تسجيل الدخول والمحاولة مرة أخرى
ja: 通話の開始に失敗しました。ログイン状態を確認して再試行してください
zh_hans: 发起通话失败，请检查登录状态后重试
zh_hant: 發起通話失敗，請檢查登錄狀態後重試

# TUICallKit.ErrorParameterInvalid
source: Parameter error
ar: خطأ المعلمة
ja: パラメータエラー
zh_hans: 参数错误
zh_hant: 參數錯誤

# TUICallKit.ErrorRequestRepeated
source: The current status is waiting/accept, please do not call it repeatedly
ar: الطريقة الحالية تتم تنفيذها، يرجى عدم استدعاءها مرة أخرى
ja: 現在実行中のメソッドを呼び出すことはできません
zh_hans: 当前方法正在执行中，请勿重复调用
zh_hant: 當前方法正在執行中，請勿重複調用

# TUICallKit.ErrorSceneNotSupport
source: The current scene does not support this function
ar: مشهد المكالمة الحالي لا يدعم هذه الوظيفة
ja: 現在の通話シーンでは、この機能はサポートしていません
zh_hans: 当前通话场景，不支持该功能
zh_hant: 當前通話場景，不支持該功能

# TUICallKit.ErrorTRTCEnterRoomFailed
source: Failed to join the call
ar: فشل الانضمام إلى المكالمة
ja: 通話への参加に失敗しました
zh_hans: 加入通话失败
zh_hant: 加入通話失敗

# TUICallKit.ErrorCameraOccupied
source: Camera is currently occupied by system call
ar: الكاميرا مشغولة حاليًا بواسطة مكالمة النظام
ja: カメラは現在システム通話によって占有されています
zh_hans: 摄像头被系统通话占用
zh_hant: 攝像頭被系統通話佔用

# TUICallKit.ErrorMicOccupied
source: Microphone is currently occupied by system call
ar: الميكروفون مشغول حاليًا بواسطة مكالمة النظام
ja: マイクは現在システム通話によって占有されています
zh_hans: 麦克风被系统通话占用
zh_hant: 麥克風被系統通話佔用

# TUICallKit.ErrorPermissonDenied
source: Permission denied, please check device settings
ar: فشل الحصول على الإذن ، يرجى التحقق من إعدادات أذونات الجهاز
ja: 権限の取得に失敗しました。デバイスの権限設定を確認してください
zh_hans: 权限获取失败，请检查设备权限设置
zh_hant: 權限獲取失敗，請檢查設備權限設置

# TUICallKit.FailedToGetCameraPermission.Title
source: No access to camera
ar: لم يتم تمكين إذن الكاميرا
ja: カメラの権限が開かれていません
zh_hans: 相机权限未开启
zh_hant: 相機權限未開啟

# TUICallKit.FailedToGetCameraPermission.Tips
source: Camera permission not enabled, unable to start video call. Go to Settings > %@ to enable camera permission
ar: لم يتم تمكين إذن الكاميرا ، لا يمكن بدء مكالمة الفيديو. انتقل إلى الإعدادات > %@ لتمكين إذن الكاميرا
ja: カメラの権限が開かれていないため、ビデオ通話を開始できません。設定 > %@ でカメラの権限を開いてください
zh_hans: 相机权限未开启，无法开启视频通话，前往「设置 > %@」中打开相机权限
zh_hant: 相機權限未開啟，無法開啟視頻通話，前往「設置 > %@」中打開相機權限

# TUICallKit.FailedToGetCameraPermission.Later
source: Later
ar: قل ذلك لاحقًا
ja: 後で言う
zh_hans: 以后再说
zh_hant: 以後再說

# TUICallKit.FailedToGetCameraPermission.Enable
source: Authorize Now
ar: فتح
ja: 開く
zh_hans: 去开启
zh_hant: 去開啟

# TUICallKit.FailedToGetMicrophonePermission.Title
source: No access to microphone
ar: لم يتم تمكين إذن الميكروفون
ja: マイクの権限が開かれていません
zh_hans: 麦克风权限未开启
zh_hant: 麥克風權限未開啟

# TUICallKit.FailedToGetMicrophonePermission.Tips
source: Microphone permission not enabled, unable to start audio/video call. Go to Settings > %@ to enable microphone permission
ar: لم يتم تمكين إذن الميكروفون ، لا يمكن بدء مكالمة صوتية / فيديو. انتقل إلى الإعدادات > %@ لتمكين إذن الميكروفون
ja: マイクの権限が開かれていないため、音声・ビデオ通話を開始できません。設定 > %@ でマイクの権限を開いてください
zh_hans: 麦克风权限未开启，无法开启音视频通话，前往「设置 > %@」中打开麦克风权限
zh_hant: 麥克風權限未開啟，無法開啟音視頻通話，前往「設置 > %@」中打開麥克風權限

# TUICallKit.FailedToGetMicrophonePermission.Later
source: Later
ar: قل ذلك لاحقًا
ja: 後で言う
zh_hans: 以后再说
zh_hant: 以後再說

# TUICallKit.FailedToGetMicrophonePermission.Enable
source: Authorize Now
ar: فتح
ja: 開く
zh_hans: 去开启
zh_hant: 去開啟

# TUICallKit.have.new.invitation
source: You have a new call
ar: لديك مكالمة جديدة
ja: 新しい通話があります
zh_hans: 您有一个新的通话
zh_hant: 您有一個新的通話

# TUICallKit.Recents.all
source: All
ar: جميع المكالمات
ja: すべて
zh_hans: 所有通话
zh_hant: 所有通話

# TUICallKit.Recents.missed
source: Missed Calls
ar: فائتة
ja: 不在着信
zh_hans: 未接来电
zh_hant: 未接來電

# TUICallKit.Recents.calls
source: Recent Calls
ar: سجل المكالمات
ja: 通話履歴
zh_hans: 最近通话
zh_hant: 最近通話

# TUICallKit.Recents.clear
source: Clear
ar: مسح
ja: 削除
zh_hans: 清除
zh_hant: 清除

# TUICallKit.Recents.done
source: Done
ar: تم
ja: 完了
zh_hans: 完成
zh_hant: 完成

# TUICallKit.Recents.delete
source: Delete
ar: حذف
ja: 削除
zh_hans: 删除
zh_hant: 刪除

# TUICallKit.Recents.addUser
source: Add User
ar: إضافة عضو
ja: メンバーを招待
zh_hans: 添加成员
zh_hant: 添加成員

# TUICallKit.Recents.clear.all
source: Clear All Call History
ar: مسح جميع السجلات
ja: すべての履歴を消去
zh_hans: 清除所有记录
zh_hant: 清除所有記錄

# TUICallKit.Recents.clear.cancel
source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

# TUICallKit.Recents.incoming
source: Incoming
ar: وارد
ja: 着信
zh_hans: 来电
zh_hant: 來電

# TUICallKit.Recents.outgoing
source: Outgoing
ar: صادر
ja: 発信
zh_hans: 去电
zh_hant: 去電

# TUICallKit.Recents.groupCallNotSupported
source: Redial is not supported for group calls
ar: إعادة الاتصال غير مدعومة لسجل المكالمات الجماعية
ja: グループ通話履歴のリダイヤルには対応していません
zh_hans: 多人通话记录不支持重呼
zh_hant: 多人通話記錄不支持重呼

# TUICallKit.JoinGroupView.title
source: %d people are on the call
ar: %d جاري المكالمة
ja: %d人が通話中です
zh_hans: %d人正在通话中
zh_hant: %d人正在通话中

# TUICallKit.JoinGroupView.join
source: Join
ar: الانضمام
ja: 参加する
zh_hans: 加入
zh_hant: 加入

# accept
source: Connect
ar: متصل
ja: 接続済み
zh_hans: 已接通
zh_hant: 已接通

source: Answer
ar: الرد
ja: 応答
zh_hans: 接听
zh_hant: 接聽

source: Blur Background
ar: الخلفية الغائمة
ja: 背景をぼかす
zh_hans: 模糊背景
zh_hant: 模糊背景

# calleeTip
source: Also on the call:
ar: أيضًا على المكالمة
ja: 通話に参加している人物
zh_hans: 参与通话的还有：
zh_hant: 參與通話的還有：

source: Camera Off
ar: إيقاف الكاميرا
ja: カメラオフ
zh_hans: 摄像头已关
zh_hant: 攝像頭已關

source: Camera On
ar: تشغيل الكاميرا
ja: カメラオン
zh_hans: 摄像头已开
zh_hant: 攝像頭已開

source: Cancel
ar: إلغاء
ja: キャンセル
zh_hans: 取消
zh_hant: 取消

source: Decline
ar: رفض
ja: 拒否
zh_hans: 拒接
zh_hant: 拒接

source: Earpiece
ar: سماعة الأذن
ja: イヤホン
zh_hans: 听筒
zh_hant: 聽筒

# Group.inviteToGroupCall
source: invites you to a group call
ar: يدعوك إلى مكالمة
ja: グループ通話に招待します
zh_hans: 邀请你加入多人通话
zh_hant: 邀請你加入多人通話

source: Hang Up
ar: إنهاء المكالمة
ja: 通話終了
zh_hans: 挂断
zh_hant: 掛斷

# inviteToAudioCall
source: invites you to a voice call
ar: يدعوك لمكالمة صوتية
ja: 音声通話に招待されました
zh_hans: 邀请你语音通话
zh_hant: 邀請你語音通話

# inviteToVideoCall
source: invites you to a video call
ar: يدعوك لمكالمة فيديو
ja: ビデオ通話に招待されました
zh_hans: 邀请你视频通话
zh_hant: 邀請你視頻通話

source: Muted
ar: كتم الصوت
ja: マイクオフ
zh_hans: 麦克风已关
zh_hant: 麥克風已關

# OtherParty.NetworkLowQuality
source: Other party's network poor
ar: شبكة الطرف الآخر ضعيفة
ja: 相手のネットワークが悪い
zh_hans: 当前通话对方网络不佳
zh_hant: 當前通話對方網絡不佳

# Self.NetworkLowQuality
source: Your network poor
ar: شبكتك ضعيفة في المكالمة
ja: あなたのネットワークが悪い
zh_hans: 当前通话你的网络不佳
zh_hant: 當前通話你的網絡不佳

# SmartCellular.cellularGood
source: Cellular network is good
ar: شبكة الجوال جيدة
ja: モバイルネットワークは良好です
zh_hans: 蜂窝网络良好
zh_hant: 蜂窩網絡良好

# SmartCellular.description
source: Current WiFi network is unstable, switch to cellular data to improve call quality.\n(Data charges may apply, depending on your plan)
ar: شبكة WiFi الحالية غير مستقرة، قم بالتبديل إلى بيانات الجوال لتحسين جودة المكالمة.\n(قد يتم تطبيق رسوم بيانات حسب خطتك)
ja: 現在のWiFiネットワークが不安定です。モバイルデータ通信に切り替えて通話品質を改善します。\n(ご利用のプランによってはデータ通信料が発生する場合があります)
zh_hans: 当前 WiFi 网络不稳定，切换至蜂窝数据改善通话质量。\n(可能产生流量费用，具体取决于您的套餐)
zh_hant: 當前 WiFi 網絡不穩定，切換至蜂窩數據改善通話質量。\n(可能產生流量費用，具體取決於您的套餐)

# SmartCellular.improve
source: Improve call quality
ar: تحسين جودة المكالمة
ja: 通話品質を改善
zh_hans: 改善通话质量
zh_hant: 改善通話質量

# SmartCellular.keepWifi
source: Keep using WiFi
ar: متابعة استخدام WiFi
ja: WiFiを使い続ける
zh_hans: 继续使用 WiFi
zh_hant: 繼續使用 WiFi

# SmartCellular.SwitchedToCellular
source: Network switched to cellular data
ar: تم تبديل الشبكة إلى بيانات الجوال
ja: ネットワークをモバイルデータ通信に切り替えました
zh_hans: 网络已切换至蜂窝数据
zh_hant: 網絡已切換至蜂窩數據

# SmartCellular.SwitchedToWiFi
source: Network switched to WiFi
ar: تم تبديل الشبكة إلى WiFi
ja: ネットワークをWiFiに切り替えました
zh_hans: 网络已切换至 WiFi
zh_hant: 網絡已切換至 WiFi

# SmartCellular.title
source: Improve call quality?
ar: تحسين جودة المكالمة؟
ja: 通話品質を改善しますか?
zh_hans: 改善通话质量?
zh_hant: 改善通話質量?

# SmartCellular.wifiPoor
source: WiFi network is poor
ar: شبكة WiFi ضعيفة
ja: WiFiネットワークが不安定です
zh_hans: WiFi 网络较差
zh_hant: WiFi 網絡較差

# speakerPhone
source: Speaker
ar: مكبر الصوت
ja: スピーカー
zh_hans: 扬声器
zh_hant: 揚聲器

# switchCamera
source: Switch
ar: يُحوّل
ja: 切り替え
zh_hans: 翻转
zh_hant: 翻轉

source: Unmuted
ar: إلغاء الكتم
ja: マイクオン
zh_hans: 麦克风已开
zh_hant: 麥克風已開

# waitAccept
source: Awaiting response
ar: انتظار قبول الطرف الآخر
ja: 応答を待っています
zh_hans: 等待对方接受邀请
zh_hant: 等待對方接受邀請

# ai_transcriber_empty_hint
source: AI Real-time Subtitles
ar: ترجمة فورية بالذكاء الاصطناعي
ja: AIリアルタイム字幕
zh_hans: AI 实时字幕
zh_hant: AI 即時字幕

# ai_transcriber_settings_title
source: AI Subtitle Settings
ar: إعدادات ترجمة AI
ja: AI字幕設定
zh_hans: AI 字幕设置
zh_hant: AI 字幕設定

# ai_transcriber_section_recognition
source: Recognition & Translation
ar: إعدادات التعرف والترجمة
ja: 認識と翻訳設定
zh_hans: 识别与翻译设置
zh_hant: 識別與翻譯設定

# ai_transcriber_source_language
source: Source Language
ar: لغة التعرف
ja: 認識言語
zh_hans: 识别语言
zh_hant: 識別語言

# ai_transcriber_translation_language
source: Translation Language
ar: لغة الترجمة
ja: 翻訳言語
zh_hans: 翻译语言
zh_hant: 翻譯語言

# ai_transcriber_bilingual_subtitle
source: Bilingual Subtitles
ar: ترجمة ثنائية اللغة
ja: バイリンガル字幕
zh_hans: 字幕显示双语
zh_hant: 字幕顯示雙語

# ai_transcriber_select_source_language
source: Select Source Language
ar: اختر لغة التعرف
ja: 認識言語を選択
zh_hans: 选择识别语言
zh_hant: 選擇識別語言

# ai_transcriber_select_translation_language
source: Select Translation Language
ar: اختر لغة الترجمة
ja: 翻訳言語を選択
zh_hans: 选择翻译语言
zh_hant: 選擇翻譯語言

# ai_transcriber_me
source: (Me)
ar: (أنا)
ja: (私)
zh_hans: (我)
zh_hant: (我)

# ai_source_lang_zh_en
source: Auto Detect(Chinese, English)
ar: اكتشاف تلقائي (الصينية، الإنجليزية)
ja: 自動検出(中国語、英語)
zh_hans: 自动识别(中英)
zh_hant: 自動識別(中英)

# ai_source_lang_zh
source: Speaking Chinese
ar: التحدث بالصينية
ja: 中国語を話す
zh_hans: 说中文
zh_hant: 說中文

# ai_source_lang_en
source: Speaking English
ar: التحدث بالإنجليزية
ja: 英語を話す
zh_hans: 说英语
zh_hant: 說英語

# ai_trans_lang_none
source: No Translation
ar: بدون ترجمة
ja: 翻訳なし
zh_hans: 不翻译
zh_hant: 不翻譯

# ai_trans_lang_zh
source: 简体中文(Chinese)
ar: 简体中文(الصينية)
ja: 简体中文(中国語)
zh_hans: 简体中文(简体中文)
zh_hant: 简体中文(簡體中文)

# ai_trans_lang_en
source: English(English)
ar: English(الإنجليزية)
ja: English(英語)
zh_hans: English(英语)
zh_hant: English(英語)

# ai_trans_lang_vi
source: Tiếng Việt(Vietnamese)
ar: Tiếng Việt(الفيتنامية)
ja: Tiếng Việt(ベトナム語)
zh_hans: Tiếng Việt(越南语)
zh_hant: Tiếng Việt(越南語)

# ai_trans_lang_ja
source: 日本語(Japanese)
ar: 日本語(اليابانية)
ja: 日本語(日本語)
zh_hans: 日本語(日语)
zh_hant: 日本語(日語)

# ai_trans_lang_ko
source: 한국어(Korean)
ar: 한국어(الكورية)
ja: 한국어(韓国語)
zh_hans: 한국어(韩语)
zh_hant: 한국어(韓語)

# ai_trans_lang_id
source: Bahasa Indonesia(Indonesian)
ar: Bahasa Indonesia(الإندونيسية)
ja: Bahasa Indonesia(インドネシア語)
zh_hans: Bahasa Indonesia(印尼语)
zh_hant: Bahasa Indonesia(印尼語)

# ai_trans_lang_th
source: ภาษาไทย(Thai)
ar: ภาษาไทย(التايلاندية)
ja: ภาษาไทย(タイ語)
zh_hans: ภาษาไทย(泰语)
zh_hant: ภาษาไทย(泰語)

# ai_trans_lang_pt
source: Português(Portuguese)
ar: Português(البرتغالية)
ja: Português(ポルトガル語)
zh_hans: Português(葡萄牙语)
zh_hant: Português(葡萄牙語)

# ai_trans_lang_ar
source: ‎العربية‎(Arabic)
ar: ‎العربية‎(العربية)
ja: ‎العربية‎(アラビア語)
zh_hans: ‎العربية‎(阿拉伯语)
zh_hant: ‎العربية‎(阿拉伯語)

# ai_trans_lang_es
source: Español(Spanish)
ar: Español(الإسبانية)
ja: Español(スペイン語)
zh_hans: Español(西班牙语)
zh_hant: Español(西班牙語)

# ai_trans_lang_fr
source: Français(French)
ar: Français(الفرنسية)
ja: Français(フランス語)
zh_hans: Français(法语)
zh_hant: Français(法語)

# ai_trans_lang_ms
source: Bahasa Melayu(Malay)
ar: Bahasa Melayu(الملايوية)
ja: Bahasa Melayu(マレー語)
zh_hans: Bahasa Melayu(马来语)
zh_hant: Bahasa Melayu(馬來語)

# ai_trans_lang_de
source: Deutsch(German)
ar: Deutsch(الألمانية)
ja: Deutsch(ドイツ語)
zh_hans: Deutsch(德语)
zh_hant: Deutsch(德語)

# ai_trans_lang_it
source: Italiano(Italian)
ar: Italiano(الإيطالية)
ja: Italiano(イタリア語)
zh_hans: Italiano(意大利语)
zh_hant: Italiano(意大利語)

# ai_trans_lang_ru
source: Русский(Russian)
ar: Русский(الروسية)
ja: Русский(ロシア語)
zh_hans: Русский(俄语)
zh_hant: Русский(俄語)
